IDEA StatiCa Open Model
MatReinforcementEc2.UserDiagram Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Stress-strain diagram defined by user
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Polygon2D UserDiagram { get; set; }
Public Property UserDiagram As Polygon2D
	Get
	Set
public:
property Polygon2D^ UserDiagram {
	Polygon2D^ get ();
	void set (Polygon2D^ value);
}
Property Value
Type: Polygon2D
See Also
Reference
MatReinforcementEc2 Class
IdeaRS.OpenModel.Material Namespace